app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ('nilmadhab', 'nilmadhab1994@gmail.com', '2026-08-25 20:12:59.429625', '2026-08-25 20:12:59.429625') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save